# Getting the Datasets for the Workbookâ€™s Exercises

In [6]:
import os
os.chdir('C:\\Users\\ssson\\OneDrive\\Desktop\\JUPYTER WORK NOTEBOOK - NIMISHAL')

# Uploading zip file

In [7]:
# Unzipping dataset.zip
path_to_zip_file = "datasets.zip"
directory_to_extract_to = ""
import zipfile
zip_ref = zipfile.ZipFile(path_to_zip_file, 'r')
zip_ref.extractall(directory_to_extract_to)
zip_ref.close()

# Getting Data Into and Out of Python

The first stage of data analysis is getting the data. Moving your data from
where you have it stored into your analytical tools and back out again can
be a difficult task if you don't know what you are doing. Python and its
libraries try to make it as easy as possible.

## Loading Data from CSV Files

In [16]:
import pandas as pd
Location = "datasets/smallgradesh.csv"
df = pd.read_csv(Location, header=None)

In [17]:
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

As you can see, our dataframe lacks column headers. Or, rather, there
are headers, but they weren't loaded as headers; they were loaded as row
one of your data. To load data that includes headers,  can use the code

## Loading Data from CSV File with Headers

In [12]:
import pandas as pd
Location = "datasets/gradedata.csv"
df1 = pd.read_csv(Location)

In [13]:
df1.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

# Loading Data from CSV file and add HEADER

In [18]:
import pandas as pd
data = pd.read_csv("datasets/smallgrades.csv", names = ["Names", "Grades"])
data.columns = ["Names", "Grades"]

In [19]:
data.head()

     Names  Grades
0   Marcia    82.4
1   Kadeem    78.2
2     Nash    79.3
3  Noelani    83.2
4  Noelani    87.4

# Saving data to csv (df.to_csv)

In [22]:
import pandas as pd
name = ['bob', 'nimisha', 'arnesh', 'neha', 'sonu', 'arun']
grades = [70,89,90,75,99,95]
Gradelist= zip(name, grades)
df = pd.DataFrame(data = Gradelist, columns = ['names', 'grades'])


df.to_csv('StudentGrades.csv', index = False, header = False)

In [27]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
Degrees = zip(names,grades,bsdegrees,msdegrees, phddegrees)
df = pd.DataFrame(data = Degrees, columns = ['names', 'grades', 'bsdegrees' , 'msdegrees' , 'phddegrees'])
df.to_csv('Degrees.csv', header = False, index = False)

In [31]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
Degrees = zip(names,grades,bsdegrees,msdegrees, phddegrees)
df = pd.DataFrame(data = Degrees, columns = ['names', 'grades', 'bsdegrees' , 'msdegrees' , 'phddegrees'])
df.to_csv('Degrees2.csv', index = False)

# Loading Data from Excel File

In [32]:
import pandas as pd
location = 'datasets/gradedata.xlsx'
df = pd.read_excel(location)

In [33]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

#  Changing column name

In [34]:
df.columns = ['first', 'last', 'sex', 'age', 'exe','hrs', 'grd', 'addr']
df.head()

,first,last,sex,age,exe,hrs,grd,addr
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

# Saving (exorting) data to Excel Files

In [35]:
import pandas as pd
name = ['arun', 'arnesh', 'krill', 'kyle', 'bob']
grade = [80,95,75,55,85]
data = zip(name, grade)
df = pd.DataFrame(data = data, columns= ['name', 'grade'])

writer = pd.ExcelWriter('dataframe.xlsx', engine = 'xlsxwriter')
df.to_excel(writer, sheet_name = 'Sheet1')
writer.save()

# Exporting Multiple Dataframes to Excel

In [42]:
writer = pd.ExcelWriter('dataframe1.xlsx', engine = 'xlsxwriter')
df.to_excel(writer, sheet_name = 'Sheet1')
df.to_excel(writer, sheet_name = 'Sheet2')
writer.save()